app/views/sessions/new.html.erb

<%= form_for :user, url: '/signin' do |f| %>
 Your name: <%= f.collection_select :name, User.order(:user_name),:user_name,:user_name, include_blank: false %>
---
SELECT "users".* FROM "users" ORDER BY "users"."user_name" ASC