app/views/textbooks/new.html.erb

    <%= form_for :textbook do |f| %>
      <%= f.collection_select :id, Textbook.all, :id, :name %>
---
SELECT "textbooks".* FROM "textbooks"