app/views/users/show.html.erb

</li>
<% @user.subjects.each do |subject| %>
---
SELECT "subjects".* FROM "subjects" INNER JOIN "user_subjects" ON "subjects"."id" = "user_subjects"."subject_id" WHERE "user_subjects"."user_id" = ?  [["user_id", 1]]

    <%=link_to "#{subject.name}", subject_path(subject) %>
        <% subject.textbooks.each do |textbook| %>
---
SELECT "textbooks".* FROM "textbooks" WHERE "textbooks"."subject_id" = ?  [["subject_id", 2]]