app/views/subjects/show.html.erb

Textbook List
<% @subject.textbooks.each do |textbook| %>
---
SELECT "textbooks".* FROM "textbooks" WHERE "textbooks"."subject_id" = ?  [["subject_id", 1]]