app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "admin"], ["LIMIT", 1]]
---
    def create
      @user = User.find_by(:user_name => user_params[:user_name])

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "3068964076479997"], ["LIMIT", 1]]
INSERT INTO "users" ("user_name", "image", "uid", "email", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def fb_create #Ayana suggested a second create path for facebook since it's so different
       #put this as a method in the user model
      #or if statement the User and save

      @user = User.find_by(uid: auth['uid'])
        #its failing due to lack of password. but because its creating authenticating through facebook,
        #you don't need to make a password. just set a random string permanently as the password - alice
      if @user
        @user = User.find_by(uid: auth['uid']) do |u|
          u.user_name = auth['info']['name']
          u.email = auth['info']['email']
          u.image = auth['info']['image']
        end
      else
        @user = User.create(uid: auth['uid']) do |u|