app/controllers/subjects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"
---
    def index
      @user = User.find_by(id: session[:user_id])
      @subjects = Subject.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "subjects" ("name") VALUES (?)  [["name", "MATH"]]
INSERT INTO "user_subjects" ("user_id", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["subject_id", 3], ["created_at", "2020-01-17 00:53:44.239650"], ["updated_at", "2020-01-17 00:53:44.239650"]]
---
    def create
       @user = User.find_by(id: session[:user_id])
        @subject = Subject.create(subject_params)
        @subject.users << @user

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
     @user = User.find_by(id: session[:user_id])
     @subject = Subject.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "subjects" SET "name" = ? WHERE "subjects"."id" = ?  [["name", "Algebra"], ["id", 1]]
---
    def update
      @user = User.find_by(id: session[:user_id])
      @subject = Subject.find(params[:id])
      @subject.name = params["subject"][:name]
      @subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "textbooks".* FROM "textbooks" WHERE "textbooks"."subject_id" = ?  [["subject_id", 3]]
---
    def show
      @subject = Subject.find(params[:id])
      @user = User.find_by(id: session[:user_id])
      @subject_textbooks = @subject.textbooks
      @textbooks = Textbook.all