app/controllers/textbooks_controller.rb

    def index
        @user = User.find_by(id: session[:user_id])
        if params[:subject_id]
            @textbooks = Subject.find(params[:subject_id]).textbooks
        else
            @textbooks = Textbook.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "textbooks".* FROM "textbooks"

    def result
        #binding.pry PRY IS HELPFUL
        @textbook = Textbook.find_by(title: params[:textbook_result][:title])
        @textbook_results = []
        @textbook_results << @textbook
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."title" = ? LIMIT ?  [["title", "Alegebra 1"], ["LIMIT", 1]]
INSERT INTO "textbooks" ("title", "description", "pages", "cost") VALUES (?, ?, ?, ?)  [["title", "Math"], ["description", "A math book"], ["pages", 2000], ["cost", 200]]

    def new
        @user = User.find_by(id: session[:user_id])
        @subject = Subject.find_by(id: params[:subject_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @user = User.find_by(id: session[:user_id])
        @subject = Subject.find_by(id: params[:subject_id])
        #if @user.admin
         @textbook = Textbook.create(textbook_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "textbooks" ("title", "description", "pages", "cost", "subject_id") VALUES (?, ?, ?, ?, ?)  [["title", "English1"], ["description", "sadasd"], ["pages", 250], ["cost", 300], ["subject_id", 3]]

    def edit
        @user = User.find_by(id: session[:user_id])
        #if @user.admin
            @textbook = Textbook.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @textbook = Textbook.find(params[:id])
        @textbook.update(description: params[:textbook][:name], pages: params[:textbook][:pages], description: params[:textbook][:description], cost: params[:textbook][:cost])
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "textbooks" SET "description" = ? WHERE "textbooks"."id" = ?  [["description", "Math with letters and numbers"], ["id", 1]]

    def show
        @textbook = Textbook.find_or_create_by(id: params[:id])
        @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]