app/controllers/textbooks_controller.rb

    def create
        @user = User.find_by(id: session[:user_id])
        if @user.admin
         @textbook = Textbook.create(textbook_params)
         @subject = Subject.new
        else
         @textbook = Textbook.find_by(id: params[:id])
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        @textbook = Textbook.find(params[:id])
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @user = User.find_by(id: session[:user_id])
        if @user.admin #delete from all textbooks
          @textbook = Textbook.find(params[:id])
          @textbook.destroy
        else #delete from student's list of textbooks
          @user.subjects.each do |subject|
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]