app/controllers/users_controller.rb

    def create #byebug is bad
        #use pry
        binding.pry
        @user = User.find_by(:user_name => user_params[:user_name])

        if @user
            flash[:message] = "Username already taken"
            redirect_to new_user_path
        elsif @user == nil
            @user = User.create(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "benitolsantos"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "user_name", "age", "email", "password_digest") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Benito"], ["last_name", "Santos"], ["user_name", "benitolsantos"], ["age", 22], ["email", 0], ["password_digest", "$2a$12$RtAB7D5HYmRkStEXshv6Sutxwy7lopaBHVKvDuGToLs3oChJl54P2"]]